Revit 2026 API

# TableMergedCell Properties

---

The TableMergedCell type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Bottom | Specifies the row index of the bottom-right corner of a table grid. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Left | Specifies the column index of the top-left corner of a table grid. |
|  | Right | Specifies the column index of the bottom-right corner of a table grid. |
|  | Top | Specifies the row index of the top-left corner of a table grid. |

#### Reference

TableMergedCell Class

Autodesk.Revit.DB Namespace